app/views/wishes/show.html.erb

SELECT "fulfillments".* FROM "fulfillments" WHERE "fulfillments"."wish_id" = 1 LIMIT 1
SELECT 1 AS one FROM "fulfillments" WHERE "fulfillments"."wish_id" = 1 LIMIT 1
---
    <p>Создано пользователем: <%= @wish.user.login %></p>
    <% if Fulfillment.exists?(wish_id: @wish.id) %>
      <p>Выполнено пользователем: <%= User.find_by(id: Fulfillment.find_by(wish_id: @wish.id).performer_id).login %></p>

SELECT 1 AS one FROM "fulfillments" WHERE "fulfillments"."wish_id" = 4 LIMIT 1
---
  </div>
  <% if !Fulfillment.exists?(wish_id: @wish.id) %>