app/views/users/profile.html.erb

    <br><h3>Мои желания</h3>
    <br><% @user.wishes.each do |wish| %>
---
SELECT "wishes".* FROM "wishes" WHERE "wishes"."user_id" = 1

        <p><%= wish.description %></p>
        <% if Fulfillment.exists?(wish_id: wish.id) %>
          <p>Выполнено пользователем: <%= User.find_by(id: Fulfillment.find_by(wish_id: wish.id).performer_id).login %></p>
---
SELECT "fulfillments".* FROM "fulfillments" WHERE "fulfillments"."wish_id" = 1 LIMIT 1
SELECT 1 AS one FROM "fulfillments" WHERE "fulfillments"."wish_id" = 23 LIMIT 1


        <% wish = Wish.find_by(id: fulfillment.wish_id)%>
---
SELECT "wishes".* FROM "wishes" WHERE "wishes"."id" = 25 LIMIT 1

                <p><%= wish.description %></p>
                <p>Создано пользователем: <%= User.find_by(id: wish.user_id).login %></p><br>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 8 LIMIT 1