app/views/home/index.html.erb

SELECT "fulfillments".* FROM "fulfillments" WHERE "fulfillments"."wish_id" = 1 LIMIT 1
SELECT 1 AS one FROM "fulfillments" WHERE "fulfillments"."wish_id" = 1 LIMIT 1
---

            <% if Fulfillment.exists?(wish_id: wish.id) %>
              <% user = User.find_by(id: Fulfillment.find_by(wish_id: wish.id).performer_id)  %>