app/controllers/home_controller.rb

  def index
    @wishes = Wish.includes(:user).all
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 1)
SELECT "wishes".* FROM "wishes"