app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("login", "password_digest", "email", "created_at", "updated_at") VALUES ('ugrozhalka', '$2a$12$XRm51kNHoZCwByDsrENRwei7aU5yayj6KD8G.M/jNYkBTKveBOhHe', 'uiva@sfedu.ru', '2024-12-21 23:09:55.899002', '2024-12-21 23:09:55.899002') RETURNING "id"

  def profile
    @user = @current_user # Передаем текущего пользователя в представление
    @fulfillments = Fulfillment.where(performer_id: @user.id)
---
SELECT "fulfillments".* FROM "fulfillments" WHERE "fulfillments"."performer_id" = 8

  def destroy
    if @current_user.destroy
---
DELETE FROM "users" WHERE "users"."id" = 3

  def set_current_user
    user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1