app/controllers/wishes_controller.rb

SELECT "wishes".* FROM "wishes"
---
  def index
    @wishes = Wish.all.includes(:user)

INSERT INTO "wishes" ("title", "description", "user_id", "created_at", "updated_at") VALUES ('  Present', 'Cake', 2, '2024-12-18 21:29:57.972644', '2024-12-18 21:29:57.972644') RETURNING "id"
---
  def create
    @wish = current_user.wishes.build(wish_params)

    if @wish.save

UPDATE "wishes" SET "title" = 'ggg', "description" = 'ggg', "updated_at" = '2024-12-21 16:16:55.077594' WHERE "wishes"."id" = 5
---
  def update
    if @wish.update(wish_params)

DELETE FROM "wishes" WHERE "wishes"."id" = 6
---
  def destroy
    if @wish.user == current_user # Проверяем, что пользователь является владельцем пожелания
      @wish.destroy

SELECT "wishes".* FROM "wishes" WHERE "wishes"."id" = 1 LIMIT 1
INSERT INTO "fulfillments" ("creator_id", "performer_id", "wish_id", "created_at", "updated_at") VALUES (8, 1, 1, '2024-12-25 02:11:23.596674', '2024-12-25 02:11:23.596674') RETURNING "id"
---
  def fulfill
    @wish = Wish.find(params[:id])
    @fulfillment = @wish.build_fulfillment
    @fulfillment.creator_id = @wish.user_id
    @fulfillment.performer_id = @current_user.id
    if @fulfillment.save

SELECT "wishes".* FROM "wishes" WHERE "wishes"."id" = 1 LIMIT 1
---
  def set_wish
    @wish = Wish.find(params[:id])